print("""
        ʙᴏᴛ sᴘᴀᴍ ɴᴏᴛɪғʏ
• ห้ามแก้เครดิต (ʜᴀᴄᴋᴛᴇᴀᴍ•ᴍᴀsɢᴏғʟ)
• ผู้สร้าง ᴍᴀsɢᴏʟʟ (เวอร์ชั่น3.8)
• เวอร์ชั่น 10.0.3.8
• ห้ามแก้โค้ด แก้ได้เฉพาะที่ให้แก้เท่านั้น
• ไม่เข้าใจโปรดถามผู้สร้าง ID: finx_20
       ขอให้โชคดีและสนุกมัน
""")

print("""••••••••••ʟᴏɢɪɴ ʀᴜɴ ɴᴏᴛɪғʏ••••••••••""")
import requests
import time
token =  'IMglzVpQAUxsJUYLzs5rWHISLWgebRXwGHbSOWBXpUv'
headers = {
    'Content-Type': 'application/x-www-form-urlencoded',
        'Authorization': f'Bearer {token}'
        }
url = 'https://notify-api.line.me/api/notify'
message =  'นิทานอีสป เรื่องหมาป่ากับลูกแกะ กาลครั้งหนึ่งนานมาแล้ว มีหมาป่าตัวหนึ่ง มันเดินผ่านหนองน้ำเล็กๆ ใกล้ที่อยู่อาศัยของมัน มันเหลือบไปเห็นเจ้าลูกแกะตัวหนึ่งกำลังกินน้ำอย่างมีความสุข ในขณะนั้นมันรู้สึกหิวพอดี จึงคิดวางแผนจับลูกแกะกินเป็นอาหารแต่ว่า.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0.S.1.0'
for i in range(1000):
        r =  requests.post(url=url, headers=headers, data={'message': message})
#        time.sleep(0.1)
        print(headers)
        r = requests.post(url=url, headers=headers, data={'message': message})